src/DataProcessors/КассовыйСервер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>КассовыйСервер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/DataProcessors/КассовыйСервер/Ext/ManagerModule.bsl
// Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровФискальногоЧекаОплатыПродажиДляККТ(ДокументОплаты, Касса) Экспорт
	
	МассивТоваров = Новый Массив;
	
	Если ДокументОплаты.ВидОперации = Перечисления.ВидыОпераций.ВзносНаЛицевойСчет Тогда
		
		МассивТоваров = ПолучитьМассивТоваровЧекаВзносаНаЛицСчетДляККТ(ДокументОплаты);
				
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДокументОплаты.РасшифровкаПлатежа Цикл
			
			ВременныйМассив = Новый Массив;
			
			Если СтрокаТЧ.ЭтоАванс И (ТипЗнч(СтрокаТЧ.ДокументАванса) = Тип("ДокументСсылка.НарядЗаказ") ИЛИ ТипЗнч(СтрокаТЧ.ДокументАванса) = Тип("ДокументСсылка.ПланЛечения")) Тогда
				
				ВременныйМассив = ПолучитьМассивТоваровЧекаВзносаНаЛицСчетДляККТ(СтрокаТЧ.ДокументАванса, ДокументОплаты.СуммаДокумента); 
				
			ИначеЕсли ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Реализация") ИЛИ ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.Прием") Тогда 
				СуммаОплаты = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.ПолучитьСуммуОплатыПоДокументу(СтрокаТЧ.ДокументОснования, ДокументОплаты);			
				ВременныйМассив = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(СтрокаТЧ.ДокументОснования, СуммаОплаты, СтрокаТЧ.Сумма, Касса);
				
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТоваров, ВременныйМассив);			
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДокументОплаты.РасшифровкаПлатежа Цикл
			
			ВременныйМассив = Новый Массив;
			
			Если ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.ВозвратОтПокупателя") И СтрокаТЧ.ЭтоАванс = Ложь Тогда
				
				ОплаченоПоДокументу = 0;
				Если ЗначениеЗаполнено(СтрокаТЧ.ДокументОснования) Тогда
					Если ТипЗнч(СтрокаТЧ.ДокументОснования) = Тип("ДокументСсылка.НарядЗаказ") Тогда
						ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "СуммаОплаченоПродажи") - СтрокаТЧ.Сумма;
					ИначеЕсли ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("СуммаОплачено", СтрокаТЧ.ДокументОснования.Метаданные()) = Истина Тогда 
						ОплаченоПоДокументу = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(СтрокаТЧ.ДокументОснования, "СуммаОплачено") - СтрокаТЧ.Сумма;
					КонецЕсли;
				КонецЕсли;
								
				ВременныйМассив = Обработки.ПомощникПроведенияОплаты.ПолучитьМассивПараметровТоваровККТ(СтрокаТЧ.ДокументОснования, ОплаченоПоДокументу, СтрокаТЧ.Сумма, Касса);				
				
				Для Каждого ЭлементМ Из ВременныйМассив Цикл
					ЭлементМ.Вставить("ВидДокумента", "ВозвратОтПокупателя");					
				КонецЦикла;           
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТоваров, ВременныйМассив);
				
			КонецЕсли;		
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат МассивТоваров;
	
КонецФункции

//Функция, возвращает массив товаров на печать
//
Функция ПолучитьМассивТоваровЧекаВзносаНаЛицСчетДляККТ(ДокументОснования, Знач ОплатаВнесено = Неопределено) // ОплатаВнесено, Организация 
	
	МассивТоваров	= Новый Массив;
	Контрагент 		= ДокументОснования.Контрагент;
	ОплатаВнесено	= ?(ОплатаВнесено <> Неопределено, ОплатаВнесено, ДокументОснования.СуммаДокумента);
	Организация		= ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОснования, "Организация"), ДокументОснования.Организация, 
		ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДокументОснования.СтруктурнаяЕдиница, "Организация"));
	
	СтрокаТовара = МенеджерОборудованияВызовСервера.ПустаяСтруктураСтрокиТоваровЧека();
	
	СтрокаТовара.Наименование           = ?(ТипЗнч(ДокументОснования) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств"), "Взнос на лицевой счет", "Аванс от: " +  Контрагент); 
	СтрокаТовара.СтоимостьБезСкидки     = ОплатаВнесено;
	СтрокаТовара.СуммаСкидки            = 0;
	СтрокаТовара.СтоимостьСоСкидкой     = ОплатаВнесено;
	СтрокаТовара.Количество             = 1;
	СтрокаТовара.СтавкаНДС              = МенеджерОборудованияВызовСервера.ПолучитьНДСПриВзносеНаЛицевойСчет(Организация);
	СтрокаТовара.СуммаНДС               = Ценообразование.РассчитатьСуммуНДС(ОплатаВнесено, СтрокаТовара.СтавкаНДС);
	СтрокаТовара.НомерСекции            = 2;
	СтрокаТовара.Штрихкод               = null;
	СтрокаТовара.СуммаОплачено			= ОплатаВнесено;
	СтрокаТовара.ЭтоОплатаКредита       = Ложь;  
	
	МассивТоваров.Добавить(СтрокаТовара);
		
	Возврат МассивТоваров;
	
КонецФункции
